#pragma once

#include "vec.h"
#include "const.h"
#include "mat.h"
#include<iostream>
#include<string>

namespace m4ths {
	void egg() {
		std::string awa = R"(
███╗   ███╗██╗  ██╗████████╗██╗  ██╗███████╗
████╗ ████║██║  ██║╚══██╔══╝██║  ██║██╔════╝
██╔████╔██║███████║   ██║   ███████║███████╗
██║╚██╔╝██║╚════██║   ██║   ██╔══██║╚════██║
██║ ╚═╝ ██║     ██║   ██║   ██║  ██║███████║
╚═╝     ╚═╝     ╚═╝   ╚═╝   ╚═╝  ╚═╝╚══════╝
)";
		std::cout << "\033[35m" << awa << "\033[0m"<<'\n';
	}




	template<
		unsigned short ROW,
		unsigned short COL>
	vec::vec<ROW> mat_mul_vec(const mat::mat<ROW, COL>& a, const vec::vec<COL>& x) { // mat*vec，我真没招了太难了，by gpt
		vec::vec<ROW> result;

		for (unsigned short i = 0; i < ROW; i++) {
			result.value[i] = 0;

			for (unsigned short j = 0; j < COL; j++) {
				result.value[i] += a.value[i][j] * x.value[j];
			}
		}
		return result;
	}
}